Feature: Качване на билет

Scenario: Успешно качване на билет
Given че потребителят е влязъл в профила си
When попълни валидни данни за билет
And натисне бутона "Качи"
Then системата трябва да запази билета и да покаже потвърждение

Scenario: Качване на билет с липсващи данни
Given че потребителят е влязъл в профила си
When остави празно поле при попълване на билет
And натисне бутона "Качи"
Then системата трябва да покаже съобщение за грешка при качване

Scenario: Качване с отрицателна цена
Given че потребителят е влязъл в профила си
When въведе отрицателна цена за билет
And натисне бутона "Качи"
Then системата трябва да покаже съобщение: "Цената не може да бъде отрицателна."

Scenario: Качване без вход
Given че потребителят не е влязъл в профила си
When отвори формата за качване
Then системата трябва да го пренасочи към login страницата

Scenario: Качване на билет за минало събитие
Given че потребителят е влязъл в профила си
When въведе събитие, което вече е минало
And натисне бутона "Качи"
Then системата трябва да откаже качването с грешка: "Събитието вече е приключило."

Scenario: Качване с цена над позволения лимит
Given че потребителят е влязъл в профила си
When въведе цена, която е с над 30% по-висока от първоначалната
And натисне бутона "Качи"
Then системата трябва да отхвърли заявката с грешка: "Цената надвишава позволения лимит."

Scenario: Качване на невалиден билет
Given че потребителят е влязъл в профила си
When качи файл с невалиден билет
Then системата трябва да откаже качването и да покаже съобщение: "Билетът не е валиден."